# 書式バリデーション
VALIDATE_FORMAT_OF_EMAIL = /[A-Za-z0-9\-\.\_]+@[A-Za-z0-9\-\_]+\.[A-Za-z0-9\-\.\_]+/

VALIDATE_FORMAT_OF_ID = /\A([a-zA-Z0-9_-]{8,})\z/
VALIDATE_FORMAT_OF_ID_TEXT = '半角英数字記号(ハイフン_とアンダースコア_)で8文字以上'
#学年ハッシュ
SCHOOL_GRADE_HASH = { 4 => '年少',
                      5 => '年中',
                      6 => '年長',
                      7 => '小1',
                      8 => '小2',
                      9 => '小3',
                      10 => '小4',
                      11 => '小5',
                      12 => '小6',
                      13 => '中1',
                      14 => '中2',
                      15 => '中3',
                      16 => '高1',
                      17 => '高2',
                      18 => '高3',
                      19 => '高卒',
                      20 => 'その他'}.freeze
